window.onload = function () {

	var serverCity = [
		// 手游QQ安卓,serverId = 0
		['手Q1区-王者独尊', '手Q2区-绝代智谋', '手Q3区-不羁之风', '手Q4区-千金重弩', '手Q5区-死亡绽放', '手Q6区-最终兵器', '手Q7区-叛逆吟游', '手Q8区-暴走机关', '手Q9区-欲望之月', '手Q10区-风华绚烂', '手Q11区-逍遥幻梦', '手Q12区-恋之微风', '手Q13区-和平守望', '手Q14区-苍天龙鸣', '手Q15区-天翔之龙', '手Q16区-破云之龙', '手Q17区-惊雷之龙', '手Q18区-友情守护', '手Q19区-豪情突进', '手Q20区-激情迸发', '手Q21区-正义豪腕', '手Q22区-治愈微笑', '手Q23区-绽放之舞', '手Q24区-甜蜜恋风', '手Q25区-星华缭乱', '手Q26区-兼爱非攻', '手Q27区-和平漫步', '手Q28区-机关重炮', '手Q29区-墨守成规', '手Q30区-活力迸发', '手Q31区-翻滚突袭', '手Q32区-红莲爆弹', '手Q33区-究极弩炮', '手Q34区-诛心剑雨', '手Q35区-灵魂冲击', '手Q36区-偶像魅力', '手Q37区-女王崇拜', '手Q38区-王朝密令', '手Q39区-圣光守护', '手Q40区-誓约之盾', '手Q41区-回旋打击', '手Q42区-圣剑裁决', '手Q43区-迟缓之箭', '手Q44区-疾风之箭', '手Q45区-寒冰箭雨', '手Q46区-惩戒射击', '手Q47区-勇气意志', '手Q48区-苍破烈斩', '手Q49区-突进之刃', '手Q50区-绽放刀锋', '手Q51区-残月利刃', '手Q52区-月光剑舞', '手Q53区-灼热之月', '手Q54区-血月之弑', '手Q55区-疯狂弹幕', '手Q56区-加农派对', '手Q57区-机关迷城', '手Q58区-青莲剑歌', '手Q59区-神来之笔', '手Q60区-逆袭之刃', '手Q61区-不羁豪气', '手Q62区-搏击拳套', '手Q63区-吸血之镰', '手Q64区-秘义之剑', '手Q65区-风暴巨剑', '手Q66区-日蚀之锤', '手Q67区-狂暴双刃', '手Q68区-凶残之力', '手Q69区-破魔之刀', '手Q70区-破灭君主', '手Q71区-名刀正宗', '手Q72区-泣血之刃', '手Q73区-无尽刀锋', '手Q74区-三圣之力', '手Q75区-黑色战斧', '手Q76区-影刃破军', '手Q77区-咒术典籍', '手Q78区-炼金护符', '手Q79区-圣者法典', '手Q80区-灵魂长卷', '手Q81区-血族之书', '手Q82区-光辉之剑', '手Q83区-小丑面罩', '手Q84区-进化水晶', '手Q85区-炽热之拥', '手Q86区-虚无法杖', '手Q87区-回响之杖', '手Q88区-冰霜法杖', '手Q89区-奇迹幻视', '手Q90区-巫术法杖', '手Q91区-时之预言', '手Q92区-贤者之书', '手Q93区-海蓝宝石', '手Q94区-绯红玛瑙', '手Q95区-抗魔披风', '手Q96区-生命宝珠', '手Q97区-杀戮之甲', '手Q98区-力量腰带', '手Q99区-熔炼之心', '手Q100区-神隐斗篷', '手Q101区-雪山圆盾', '手Q102区-军团荣耀', '手Q103区-反伤刺甲', '手Q104区-红莲斗篷', '手Q105区-霸者重装', '手Q106区-敬畏虚空', '手Q107区-振兴之铠', '手Q108区-魔女面纱', '手Q109区-寒冰之心', '手Q110区-贤者庇护', '手Q111区-暴烈之甲', '手Q112区-神速之靴', '手Q113区-影忍之足', '手Q114区-冷静抵抗', '手Q115区-急速秘法', '手Q116区-召唤战场', '手Q117区-通天之塔', '手Q118区-疾步之靴', '手Q119区-狩猎宽刃', '手Q120区-符文大剑', '手Q121区-巨人之握', '手Q122区-贪婪之噬', '手Q123区-追击刀锋', '手Q124区-巡守利斧', '手Q125区-游击弯刀', '手Q126区-幽灵疾步', '手Q127区-心灵治疗', '手Q128区-重力眩晕', '手Q129区-自然净化', '手Q130区-振奋冲击', '手Q131区-圣骑王者', '手Q132区-精灵冰弓', '手Q133区-魔法大师', '手Q134区-地狱岩魂', '手Q135区-万圣前夜', '手Q136区-忍者炎影', '手Q137区-未来纪元', '手Q138区-皇家上将', '手Q139区-仁德义枪', '手Q140区-禁血狂兽', '手Q141区-一骑当千', '手Q142区-单刀赴会', '手Q143区-青龙偃月', '手Q144区-侠客行', '手Q145区-将进酒', '手Q146区-强化霰弹', '手Q147区-双重射击', '手Q148区-震荡射击', '手Q149区-万象初新', '手Q150区-黑暗潜能', '手Q151区-画地为牢', '手Q152区-狂意杀戮', '手Q153区-守护机关', '手Q154区-崩裂践踏', '手Q155区-狂兽血性', '手Q156区-饕餮血统', '手Q157区-方天画斩', '手Q158区-贪狼之握', '手Q159区-魔神降世', '手Q160区-大圣神威', '手Q161区-七十二变', '手Q162区-斗战冲锋', '手Q163区-如意金箍', '手Q164区-战争践踏', '手Q165区-大地震撼', '手Q166区-横行霸道', '手Q167区-野性意志', '手Q168区-语花印', '手Q169区-落红雨', '手Q170区-缘心结', '手Q171区-绽风华', '手Q172区-齐天大圣', '手Q173区-精英酋长', '手Q174区-半神之弓', '手Q175区-摘星楼', '手Q176区-王者峡谷', '手Q177区-长平战场', '手Q178区-海洋之心', '手Q179区-白衣执事', '手Q180区-天鹅之梦', '手Q181区-大魔术师', '手Q182区-职棒王牌', '手Q183区-天魔缭乱', '手Q184区-紫霞仙子', '手Q185区-教廷特使', '手Q186区-我是歌手', '手Q187区-天堂福音', '手Q188区-波斯王子', '手Q189区-荒野镖客', '手Q190区-西部镖客', '手Q191区-荣耀王者', '手Q192区-哥特玫瑰', '手Q193区-绯红之刃', '手Q194区-鬼之武者', '手Q195区-地狱之火', '手Q196区-天启骑士', '手Q197区-花好人间', '手Q198区-大秦宣后', '手Q199区-万事如意', '手Q200区-龙腾万里','手Q201区-密探之力','手Q202区-谍影重重','手Q203区-无间刃锋','手Q204区-制裁仪式','手Q205区-虚空吞没','手Q206区-湮灭之锁','手Q207区-轮回吞噬','手Q208区-飞翔龙炎','手Q209区-花蝶之扇','手Q210区-必杀忍蜂','手Q211区-流刀舞术','手Q212区-飞鹰攻击','手Q213区-清风之刃','手Q214区-飞鹰急袭','手Q215区-大唐传奇','手Q216区-桃园结义','手Q217区-燎原火','手Q218区-血之咆哮','手Q219区-天之劫','手Q220区-不死之王','手Q221区-荆棘之心','手Q222区-魔女斗篷','手Q223区-觉醒水晶','手Q224区-新月残像','手Q225区-神圣心石','手Q226区-死海文书','手Q227区-王的铁面','手Q228区-王城密探','手Q229区-虚灵城判','手Q230区-鹰之守护','手Q231区-明媚烈焰','手Q232区-地府判官','手Q233区-特种小队','手Q234区-狮心王','手Q235区-千年之狐','手Q236区-灾厄尽头','手Q237区-稷下战场','手Q238区-传送之扉','手Q239区-杀戮回忆','手Q240区-机关迷城','手Q241区-隐秘牢笼','手Q242区-意志传承','手Q243区-时光倒流','手Q244区-长平攻防','手Q245区-血浓于血','手Q246区-魔道探索','手Q247区-魔道信仰','手Q248区-博学魔道','手Q249区-王族血统','手Q250区-天潢贵胄'],
		// 微信安卓,serverId = 1
		['微信1区-鲜血枭雄', '微信2区-国士无双', '微信3区-太古魔导', '微信4区-热烈之斧', '微信5区-双面君主', '微信6区-万古长明', '微信7区-洛神降临', '微信8区-王者审判', '微信9区-王者惩戒', '微信10区-王者守御', '微信11区-至尊王权', '微信12区-火力压制', '微信13区-无敌鲨炮', '微信14区-自然意志', '微信15区-庄子化蝶', '微信16区-蝴蝶效应', '微信17区-天人合一', '微信18区-磁力屏障', '微信19区-霸王护盾', '微信20区-机关魔爪', '微信21区-暴走熊猫', '微信22区-刺客信条', '微信23区-石之炼金', '微信24区-狂飙突进', '微信25区-震慑打击', '微信26区-飓风之锤', '微信27区-时间沙漏', '微信28区-时空爆弹', '微信29区-时之波动', '微信30区-时光流逝', '微信31区-魔音贯耳', '微信32区-易水离歌', '微信33区-金属风暴', '微信34区-巨龙骑士', '微信35区-仙境漫游', '微信36区-摇滚巨星', '微信37区-暗夜贵族', '微信38区-优雅恋人', '微信39区-火炮千金', '微信40区-水果甜心', '微信41区-蔷薇恋人', '微信42区-热情杀手', '微信43区-木偶奇遇', '微信44区-福禄兄弟', '微信45区-电玩小子', '微信46区-鲤鱼之梦', '微信47区-英喵野望', '微信48区-绅士熊喵', '微信49区-爱心护理', '微信50区-甜蜜猫娘', '微信51区-生化危机', '微信52区-未来旅行', '微信53区-天使之翼', '微信54区-红莲之瞳', '微信55区-化身博士', '微信56区-白色死神', '微信57区-红桃皇后', '微信58区-冬日舞会', '微信59区-暗鸦之灵', '微信60区-海军大将', '微信61区-冰雪奇缘', '微信62区-暗影之王', '微信63区-超能战警', '微信64区-幽灵船长', '微信65区-黄金武士', '微信66区-鬼泣武者', '微信67区-合金装备', '微信68区-大发明家', '微信69区-帝国元帅', '微信70区-苍穹之光', '微信71区-海滩派对', '微信72区-东方不败', '微信73区-潮流仙人', '微信74区-爱与正义', '微信75区-超能陆战', '微信76区-圣殿之光', '微信77区-街头霸王', '微信78区-湖中之女', '微信79区-活力咆哮', '微信80区-寄生守御', '微信81区-顽强斗志', '微信82区-刺秦之地', '微信83区-五福同心', '微信84区-真爱至上', '微信85区-纯白花嫁', '微信86区-拳皇', '微信87区-性感猫娘', '微信88区-致命诱惑', '微信89区-美猴王', '微信90区-锦衣卫'],
		// 手游Q苹果,serverId = 2
		['手Q1区-苍天翔龙', '手Q2区-铁血都督', '手Q3区-野蛮之锤', '手Q4区-正义爆轰', '手Q5区-机关造物', '手Q6区-名士狂歌', '手Q7区-致命灵药', '手Q8区-不死之炎', '手Q9区-生命主宰', '手Q10区-反击之镰', '手Q11区-血之回响', '手Q12区-死神之镰', '手Q13区-二天一流', '手Q14区-永生之血', '手Q15区-君临天地', '手Q16区-渴望之血', '手Q17区-欲望之月', '手Q18区-运筹帷幄', '手Q19区-东风来袭', '手Q20区-谋略法球', '手Q21区-八卦阵列', '手Q22区-叹息激流', '手Q23区-乱世争霸', '手Q24区-霸道之刃', '手Q25区-纵横天下', '手Q26区-浴血枭雄', '手Q27区-陷阵之志', '手Q28区-霸王之斩', '手Q29区-回旋打击', '手Q30区-影子杀手', '手Q31区-勇气幻盾', '手Q32区-复仇箴言', '手Q33区-激昂猛攻', '手Q34区-风怒结界', '手Q35区-突进白刃', '手Q36区-狂乱奔流', '手Q37区-崩坏意志', '手Q38区-贯穿破甲', '手Q39区-元气再生', '手Q40区-神速瞬影', '手Q41区-乱舞心火', '手Q42区-致命凋零', '手Q43区-信念绽放', '手Q44区-野性潜能', '手Q45区-警戒迷雾', '手Q46区-生机振奋', '手Q47区-无畏铁躯', '手Q48区-庇佑沙漏', '手Q49区-奇袭冲锋', '手Q50区-痛苦狙击', '手Q51区-正义清算', '手Q52区-风暴滋生', '手Q53区-灵感复苏', '手Q54区-传送之扉', '手Q55区-净化共鸣', '手Q56区-狂热煞气', '手Q57区-暴戾气数', '手Q58区-傲慢戒律', '手Q59区-阳炎回声', '手Q60区-弧光静默', '手Q61区-刹那处决', '手Q62区-睿智升华', '手Q63区-暴走冲锋', '手Q64区-锐利鹰眼', '手Q65区-灵山献祭', '手Q66区-地狱岩魂', '手Q67区-白执事', '手Q68区-女仆咖啡', '手Q69区-夺宝奇兵', '手Q70区-驱魔猎手', '手Q71区-异域舞娘', '手Q72区-迷城魅影', '手Q73区-剑舞者', '手Q74区-死亡骑士', '手Q75区-精灵之王', '手Q76区-破晓极意', '手Q77区-隐袭幻杀', '手Q78区-炙热剑芒', '手Q79区-赤月冲击', '手Q80区-燎原箭雨'],
		// 微信苹果,serverId = 3
		['微信1区-绚烂刀锋', '微信2区-智慧之拳', '微信3区-大唐名探', '微信4区-冰雪之华', '微信5区-逆流之时', '微信6区-破釜沉舟', '微信7区-天命之女', '微信8区-女帝辉光', '微信9区-女帝威严', '微信10区-生杀予夺', '微信11区-师道尊严', '微信12区-圣人训诫', '微信13区-圣人之威', '微信14区-舍生忘死', '微信15区-爆裂双斧', '微信16区-激热回旋', '微信17区-正义潜能', '微信18区-杀意之枪', '微信19区-无情冲锋', '微信20区-背水一战', '微信21区-国士无双', '微信22区-冰封之心', '微信23区-凋零冰晶', '微信24区-禁锢寒霜', '微信25区-凛冬已至', '微信26区-鲜血之舞', '微信27区-死亡之吻', '微信28区-无相明王', '微信29区-七月流火', '微信30区-烽火赤壁', '微信31区-深渊囚笼', '微信32区-进化根源', '微信33区-轮回不灭', '微信34区-契约奇迹', '微信35区-隐匿暗杀', '微信36区-调和均衡', '微信37区-冥想繁荣', '微信38区-禁忌誓言', '微信39区-红莲之窟', '微信40区-红月追忆', '微信41区-长生信使', '微信42区-夺萃狩猎', '微信43区-夫子试炼', '微信44区-超凡无双', '微信45区-白夜梦魇', '微信46区-终结一闪', '微信47区-圣人传承', '微信48区-宿命血咒', '微信49区-异变荆棘', '微信50区-嗜血波动', '微信51区-金刚坚壁', '微信52区-倔强青铜', '微信53区-秩序白银', '微信54区-荣耀黄金', '微信55区-尊贵铂金', '微信56区-永恒钻石', '微信57区-最强王者', '微信58区-陨落废都', '微信59区-稷下学院', '微信60区-灭国战场', '微信61区-堕落祸源', '微信62区-庄子幻梦', '微信63区-世外之地', '微信64区-黄沙关隘', '微信65区-易水之畔']
	]


	// 封装函数
	function getId(id){
		var elem = document.getElementById(id);
		if(!elem) {
			return false;
		}
		return elem
	}

	// 删除元素
	function removeEleChild(elem){
		// console.log(elem)
		var childArr = elem.childNodes;
		var newArr = [];
		for(var i = 0; i < childArr.length;i++){
			if(childArr[i].nodeType === 1) {
				newArr.push(childArr[i])
			}
		}
		
		for(var k = 0; k < newArr.length; k ++){
			elem.removeChild(newArr[k]);
			// if(!elem.children){
			// 	return true
			// }
		}
	}

	// 增加元素
	function addOption(ele,type){
		type = 1 * type;
		var gameCityf = serverCity[type-1];
		var frag = document.createDocumentFragment();
		console.log(gameCityf);
		for(var i = 0; i< gameCityf.length; i++) {
			var option = document.createElement("option");
			option.innerHTML = gameCityf[i];
			// console.log(option)
			frag.appendChild(option);
		}
		ele.appendChild(frag);

	}

	// 监听时间

	function addEvent(elem,type,fun){
		if(elem.addEventListener){
			elem.addEventListener(type,fun);
		}else if (elem.attachEvent) {
			elem.attachEvent("on"+type,fun);
		}
	}

	// 业务代码
	// 事件源
	var eventYuan = getId("pingTai");

	// 处理元素
	var gameYuan = getId("gameCity");

	console.log(eventYuan)
	// 监听程序
	addEvent(eventYuan,"change",function(){
		// 做一些事情
		// 删除全部节点
		var gameCity = eventYuan.value;
		removeEleChild(gameYuan)
		addOption(gameYuan,gameCity)
	})
	// var gameCity = eventYuan.value;
	// console.log(gameCity)

	addEvent(getId("step3Btn"),"click",function(){
		alert("您的订单未付款，请扫描二维码付款！");
	})


// 游戏帐号：
// username
// 
// 确认账号
// username2
var username = getId("username"),
	username2 = getId("username2"),
	indexId = getId("indexId");
	console.log(username2)
// console.log(username);
addEvent(username,"change",function(){
	userval = username.value;
	console.log(userval);
})
addEvent(username2,"change",function(){
	user2val = username2.value;
	console.log(user2val);
})

	addEvent(indexId,"click",function(){
		// console.log(getId("username").value)
		
		if(getId("username").value == "" || getId("username2").value == ""){
			alert("两次输入的账号不一样或账号为空");
			return false;

		}

		else if(getId("username").value !== getId("username2").value){
			alert("两次输入的账号不一样或账号为空");

			return false;
		}else if(getId("username").value === getId("username2").value){

		// window.location.href='http://www.ddhbb.com';
		
			var protocol = location.protocol;
			var host = location.host;
			var url = protocol + "\/\/" + host + "\/step2.html";
			location.href = url;
			return true
		}

	})
	// addEvent(username2,"blur",function(){
	// 	 if(!username.value === username2.value){
	// 	 	alert("两次输入的账号不一样");
	// 	}
	// })


















}

// 	// 首页交互
	
// 	// 选中平台,然后增删改查游戏区

// 	$("#pingTai").on("change",function(){
// 		// console.log($(this).val());
// 		$serverId = $(this).val();
// 		changeGameCity($serverId);
// 	})
// 	var serverCity = [
// 		// 手游QQ安卓,serverId = 0
// 		['手Q1区-王者独尊', '手Q2区-绝代智谋', '手Q3区-不羁之风', '手Q4区-千金重弩', '手Q5区-死亡绽放', '手Q6区-最终兵器', '手Q7区-叛逆吟游', '手Q8区-暴走机关', '手Q9区-欲望之月', '手Q10区-风华绚烂', '手Q11区-逍遥幻梦', '手Q12区-恋之微风', '手Q13区-和平守望', '手Q14区-苍天龙鸣', '手Q15区-天翔之龙', '手Q16区-破云之龙', '手Q17区-惊雷之龙', '手Q18区-友情守护', '手Q19区-豪情突进', '手Q20区-激情迸发', '手Q21区-正义豪腕', '手Q22区-治愈微笑', '手Q23区-绽放之舞', '手Q24区-甜蜜恋风', '手Q25区-星华缭乱', '手Q26区-兼爱非攻', '手Q27区-和平漫步', '手Q28区-机关重炮', '手Q29区-墨守成规', '手Q30区-活力迸发', '手Q31区-翻滚突袭', '手Q32区-红莲爆弹', '手Q33区-究极弩炮', '手Q34区-诛心剑雨', '手Q35区-灵魂冲击', '手Q36区-偶像魅力', '手Q37区-女王崇拜', '手Q38区-王朝密令', '手Q39区-圣光守护', '手Q40区-誓约之盾', '手Q41区-回旋打击', '手Q42区-圣剑裁决', '手Q43区-迟缓之箭', '手Q44区-疾风之箭', '手Q45区-寒冰箭雨', '手Q46区-惩戒射击', '手Q47区-勇气意志', '手Q48区-苍破烈斩', '手Q49区-突进之刃', '手Q50区-绽放刀锋', '手Q51区-残月利刃', '手Q52区-月光剑舞', '手Q53区-灼热之月', '手Q54区-血月之弑', '手Q55区-疯狂弹幕', '手Q56区-加农派对', '手Q57区-机关迷城', '手Q58区-青莲剑歌', '手Q59区-神来之笔', '手Q60区-逆袭之刃', '手Q61区-不羁豪气', '手Q62区-搏击拳套', '手Q63区-吸血之镰', '手Q64区-秘义之剑', '手Q65区-风暴巨剑', '手Q66区-日蚀之锤', '手Q67区-狂暴双刃', '手Q68区-凶残之力', '手Q69区-破魔之刀', '手Q70区-破灭君主', '手Q71区-名刀正宗', '手Q72区-泣血之刃', '手Q73区-无尽刀锋', '手Q74区-三圣之力', '手Q75区-黑色战斧', '手Q76区-影刃破军', '手Q77区-咒术典籍', '手Q78区-炼金护符', '手Q79区-圣者法典', '手Q80区-灵魂长卷', '手Q81区-血族之书', '手Q82区-光辉之剑', '手Q83区-小丑面罩', '手Q84区-进化水晶', '手Q85区-炽热之拥', '手Q86区-虚无法杖', '手Q87区-回响之杖', '手Q88区-冰霜法杖', '手Q89区-奇迹幻视', '手Q90区-巫术法杖', '手Q91区-时之预言', '手Q92区-贤者之书', '手Q93区-海蓝宝石', '手Q94区-绯红玛瑙', '手Q95区-抗魔披风', '手Q96区-生命宝珠', '手Q97区-杀戮之甲', '手Q98区-力量腰带', '手Q99区-熔炼之心', '手Q100区-神隐斗篷', '手Q101区-雪山圆盾', '手Q102区-军团荣耀', '手Q103区-反伤刺甲', '手Q104区-红莲斗篷', '手Q105区-霸者重装', '手Q106区-敬畏虚空', '手Q107区-振兴之铠', '手Q108区-魔女面纱', '手Q109区-寒冰之心', '手Q110区-贤者庇护', '手Q111区-暴烈之甲', '手Q112区-神速之靴', '手Q113区-影忍之足', '手Q114区-冷静抵抗', '手Q115区-急速秘法', '手Q116区-召唤战场', '手Q117区-通天之塔', '手Q118区-疾步之靴', '手Q119区-狩猎宽刃', '手Q120区-符文大剑', '手Q121区-巨人之握', '手Q122区-贪婪之噬', '手Q123区-追击刀锋', '手Q124区-巡守利斧', '手Q125区-游击弯刀', '手Q126区-幽灵疾步', '手Q127区-心灵治疗', '手Q128区-重力眩晕', '手Q129区-自然净化', '手Q130区-振奋冲击', '手Q131区-圣骑王者', '手Q132区-精灵冰弓', '手Q133区-魔法大师', '手Q134区-地狱岩魂', '手Q135区-万圣前夜', '手Q136区-忍者炎影', '手Q137区-未来纪元', '手Q138区-皇家上将', '手Q139区-仁德义枪', '手Q140区-禁血狂兽', '手Q141区-一骑当千', '手Q142区-单刀赴会', '手Q143区-青龙偃月', '手Q144区-侠客行', '手Q145区-将进酒', '手Q146区-强化霰弹', '手Q147区-双重射击', '手Q148区-震荡射击', '手Q149区-万象初新', '手Q150区-黑暗潜能', '手Q151区-画地为牢', '手Q152区-狂意杀戮', '手Q153区-守护机关', '手Q154区-崩裂践踏', '手Q155区-狂兽血性', '手Q156区-饕餮血统', '手Q157区-方天画斩', '手Q158区-贪狼之握', '手Q159区-魔神降世', '手Q160区-大圣神威', '手Q161区-七十二变', '手Q162区-斗战冲锋', '手Q163区-如意金箍', '手Q164区-战争践踏', '手Q165区-大地震撼', '手Q166区-横行霸道', '手Q167区-野性意志', '手Q168区-语花印', '手Q169区-落红雨', '手Q170区-缘心结', '手Q171区-绽风华', '手Q172区-齐天大圣', '手Q173区-精英酋长', '手Q174区-半神之弓', '手Q175区-摘星楼', '手Q176区-王者峡谷', '手Q177区-长平战场', '手Q178区-海洋之心', '手Q179区-白衣执事', '手Q180区-天鹅之梦', '手Q181区-大魔术师', '手Q182区-职棒王牌', '手Q183区-天魔缭乱', '手Q184区-紫霞仙子', '手Q185区-教廷特使', '手Q186区-我是歌手', '手Q187区-天堂福音', '手Q188区-波斯王子', '手Q189区-荒野镖客', '手Q190区-西部镖客', '手Q191区-荣耀王者', '手Q192区-哥特玫瑰', '手Q193区-绯红之刃', '手Q194区-鬼之武者', '手Q195区-地狱之火', '手Q196区-天启骑士', '手Q197区-花好人间', '手Q198区-大秦宣后', '手Q199区-万事如意', '手Q200区-龙腾万里','手Q201区-密探之力','手Q202区-谍影重重','手Q203区-无间刃锋','手Q204区-制裁仪式','手Q205区-虚空吞没','手Q206区-湮灭之锁','手Q207区-轮回吞噬','手Q208区-飞翔龙炎','手Q209区-花蝶之扇','手Q210区-必杀忍蜂','手Q211区-流刀舞术','手Q212区-飞鹰攻击','手Q213区-清风之刃','手Q214区-飞鹰急袭','手Q215区-大唐传奇','手Q216区-桃园结义','手Q217区-燎原火','手Q218区-血之咆哮','手Q219区-天之劫','手Q220区-不死之王','手Q221区-荆棘之心','手Q222区-魔女斗篷','手Q223区-觉醒水晶','手Q224区-新月残像','手Q225区-神圣心石','手Q226区-死海文书','手Q227区-王的铁面','手Q228区-王城密探','手Q229区-虚灵城判','手Q230区-鹰之守护','手Q231区-明媚烈焰','手Q232区-地府判官','手Q233区-特种小队','手Q234区-狮心王','手Q235区-千年之狐','手Q236区-灾厄尽头','手Q237区-稷下战场','手Q238区-传送之扉','手Q239区-杀戮回忆','手Q240区-机关迷城','手Q241区-隐秘牢笼','手Q242区-意志传承','手Q243区-时光倒流','手Q244区-长平攻防','手Q245区-血浓于血','手Q246区-魔道探索','手Q247区-魔道信仰','手Q248区-博学魔道','手Q249区-王族血统','手Q250区-天潢贵胄'],
// 		// 微信安卓,serverId = 1
// 		['微信1区-鲜血枭雄', '微信2区-国士无双', '微信3区-太古魔导', '微信4区-热烈之斧', '微信5区-双面君主', '微信6区-万古长明', '微信7区-洛神降临', '微信8区-王者审判', '微信9区-王者惩戒', '微信10区-王者守御', '微信11区-至尊王权', '微信12区-火力压制', '微信13区-无敌鲨炮', '微信14区-自然意志', '微信15区-庄子化蝶', '微信16区-蝴蝶效应', '微信17区-天人合一', '微信18区-磁力屏障', '微信19区-霸王护盾', '微信20区-机关魔爪', '微信21区-暴走熊猫', '微信22区-刺客信条', '微信23区-石之炼金', '微信24区-狂飙突进', '微信25区-震慑打击', '微信26区-飓风之锤', '微信27区-时间沙漏', '微信28区-时空爆弹', '微信29区-时之波动', '微信30区-时光流逝', '微信31区-魔音贯耳', '微信32区-易水离歌', '微信33区-金属风暴', '微信34区-巨龙骑士', '微信35区-仙境漫游', '微信36区-摇滚巨星', '微信37区-暗夜贵族', '微信38区-优雅恋人', '微信39区-火炮千金', '微信40区-水果甜心', '微信41区-蔷薇恋人', '微信42区-热情杀手', '微信43区-木偶奇遇', '微信44区-福禄兄弟', '微信45区-电玩小子', '微信46区-鲤鱼之梦', '微信47区-英喵野望', '微信48区-绅士熊喵', '微信49区-爱心护理', '微信50区-甜蜜猫娘', '微信51区-生化危机', '微信52区-未来旅行', '微信53区-天使之翼', '微信54区-红莲之瞳', '微信55区-化身博士', '微信56区-白色死神', '微信57区-红桃皇后', '微信58区-冬日舞会', '微信59区-暗鸦之灵', '微信60区-海军大将', '微信61区-冰雪奇缘', '微信62区-暗影之王', '微信63区-超能战警', '微信64区-幽灵船长', '微信65区-黄金武士', '微信66区-鬼泣武者', '微信67区-合金装备', '微信68区-大发明家', '微信69区-帝国元帅', '微信70区-苍穹之光', '微信71区-海滩派对', '微信72区-东方不败', '微信73区-潮流仙人', '微信74区-爱与正义', '微信75区-超能陆战', '微信76区-圣殿之光', '微信77区-街头霸王', '微信78区-湖中之女', '微信79区-活力咆哮', '微信80区-寄生守御', '微信81区-顽强斗志', '微信82区-刺秦之地', '微信83区-五福同心', '微信84区-真爱至上', '微信85区-纯白花嫁', '微信86区-拳皇', '微信87区-性感猫娘', '微信88区-致命诱惑', '微信89区-美猴王', '微信90区-锦衣卫'],
// 		// 手游Q苹果,serverId = 2
// 		['手Q1区-苍天翔龙', '手Q2区-铁血都督', '手Q3区-野蛮之锤', '手Q4区-正义爆轰', '手Q5区-机关造物', '手Q6区-名士狂歌', '手Q7区-致命灵药', '手Q8区-不死之炎', '手Q9区-生命主宰', '手Q10区-反击之镰', '手Q11区-血之回响', '手Q12区-死神之镰', '手Q13区-二天一流', '手Q14区-永生之血', '手Q15区-君临天地', '手Q16区-渴望之血', '手Q17区-欲望之月', '手Q18区-运筹帷幄', '手Q19区-东风来袭', '手Q20区-谋略法球', '手Q21区-八卦阵列', '手Q22区-叹息激流', '手Q23区-乱世争霸', '手Q24区-霸道之刃', '手Q25区-纵横天下', '手Q26区-浴血枭雄', '手Q27区-陷阵之志', '手Q28区-霸王之斩', '手Q29区-回旋打击', '手Q30区-影子杀手', '手Q31区-勇气幻盾', '手Q32区-复仇箴言', '手Q33区-激昂猛攻', '手Q34区-风怒结界', '手Q35区-突进白刃', '手Q36区-狂乱奔流', '手Q37区-崩坏意志', '手Q38区-贯穿破甲', '手Q39区-元气再生', '手Q40区-神速瞬影', '手Q41区-乱舞心火', '手Q42区-致命凋零', '手Q43区-信念绽放', '手Q44区-野性潜能', '手Q45区-警戒迷雾', '手Q46区-生机振奋', '手Q47区-无畏铁躯', '手Q48区-庇佑沙漏', '手Q49区-奇袭冲锋', '手Q50区-痛苦狙击', '手Q51区-正义清算', '手Q52区-风暴滋生', '手Q53区-灵感复苏', '手Q54区-传送之扉', '手Q55区-净化共鸣', '手Q56区-狂热煞气', '手Q57区-暴戾气数', '手Q58区-傲慢戒律', '手Q59区-阳炎回声', '手Q60区-弧光静默', '手Q61区-刹那处决', '手Q62区-睿智升华', '手Q63区-暴走冲锋', '手Q64区-锐利鹰眼', '手Q65区-灵山献祭', '手Q66区-地狱岩魂', '手Q67区-白执事', '手Q68区-女仆咖啡', '手Q69区-夺宝奇兵', '手Q70区-驱魔猎手', '手Q71区-异域舞娘', '手Q72区-迷城魅影', '手Q73区-剑舞者', '手Q74区-死亡骑士', '手Q75区-精灵之王', '手Q76区-破晓极意', '手Q77区-隐袭幻杀', '手Q78区-炙热剑芒', '手Q79区-赤月冲击', '手Q80区-燎原箭雨'],
// 		// 微信苹果,serverId = 3
// 		['微信1区-绚烂刀锋', '微信2区-智慧之拳', '微信3区-大唐名探', '微信4区-冰雪之华', '微信5区-逆流之时', '微信6区-破釜沉舟', '微信7区-天命之女', '微信8区-女帝辉光', '微信9区-女帝威严', '微信10区-生杀予夺', '微信11区-师道尊严', '微信12区-圣人训诫', '微信13区-圣人之威', '微信14区-舍生忘死', '微信15区-爆裂双斧', '微信16区-激热回旋', '微信17区-正义潜能', '微信18区-杀意之枪', '微信19区-无情冲锋', '微信20区-背水一战', '微信21区-国士无双', '微信22区-冰封之心', '微信23区-凋零冰晶', '微信24区-禁锢寒霜', '微信25区-凛冬已至', '微信26区-鲜血之舞', '微信27区-死亡之吻', '微信28区-无相明王', '微信29区-七月流火', '微信30区-烽火赤壁', '微信31区-深渊囚笼', '微信32区-进化根源', '微信33区-轮回不灭', '微信34区-契约奇迹', '微信35区-隐匿暗杀', '微信36区-调和均衡', '微信37区-冥想繁荣', '微信38区-禁忌誓言', '微信39区-红莲之窟', '微信40区-红月追忆', '微信41区-长生信使', '微信42区-夺萃狩猎', '微信43区-夫子试炼', '微信44区-超凡无双', '微信45区-白夜梦魇', '微信46区-终结一闪', '微信47区-圣人传承', '微信48区-宿命血咒', '微信49区-异变荆棘', '微信50区-嗜血波动', '微信51区-金刚坚壁', '微信52区-倔强青铜', '微信53区-秩序白银', '微信54区-荣耀黄金', '微信55区-尊贵铂金', '微信56区-永恒钻石', '微信57区-最强王者', '微信58区-陨落废都', '微信59区-稷下学院', '微信60区-灭国战场', '微信61区-堕落祸源', '微信62区-庄子幻梦', '微信63区-世外之地', '微信64区-黄沙关隘', '微信65区-易水之畔']
// 	]
// 	function changeGameCity(cityId){
// 		// 服务器ID,
// 		// 删除全部节点
// 		// 根据cityID拼接字符串
// 		var arrId = 1 * cityId;
// 		var gameCity = serverCity[arrId+1];
// 		 // console.log(gameCity);
// 		 // console.log(gameCity)
// 		 for(var i = 0; i < gameCity.length; i++){
// 			var str = "<option>" + gameCity[i] + "</option>"
 
// 			$("#gameCity")[0].appendChild(str);

// 		 }

// 	}
 






// })